import pandas as pd

"""
Pandas — это библиотека для языка Python, которая используется для работы с табличными данными. 
Она очень популярна в анализе данных, машинном обучении и науке о данных.

Основные возможности Pandas:
- Работа с таблицами (чтение, запись, фильтрация, агрегация).
- Обработка больших массивов данных быстро и эффективно.
- Простые и мощные операции с данными: группировка, объединение, сортировка.
"""


def test_data_types_series():
    """
    Series
    Одномерный массив, похожий на список или колонку таблицы.
    Может иметь индекс, чтобы каждому элементу соответствовал ключ.

    Основные свойства Series
     - Данные — сами значения (числа, строки, булевы значения и т.д.)
     - Индексы — метки для каждой позиции, по которым можно быстро обращаться к элементам
    """
    s = pd.Series([10, 20, 30], index=["a", "b", "c"])
    assert list(s.index) == ["a", "b", "c"]

    # shape возвращает кортеж с одной цифрой, которая показывает количество элементов:
    assert s.shape == (3,)

    # Доступ по позиции (нельзя просто s[0] = To access a value by position, use `ser.iloc[pos]`)
    assert s.iloc[0] == 10
    # Доступ по индексу
    assert s["a"] == 10

    # Можно делать срезы.
    # Срезы являются копиями
    sl = s[0:2]
    assert sl.shape == (2,)

    # Можно делать срезы по индексу
    sl = s["a":"b"]
    assert sl.shape == (2,)

    # Можно делать арифметические операции сразу со срезом
    sl = sl + 100
    assert sl["a"] == 110
    # Так как срез это копия, то оригинальный Series не изменился
    assert s["a"] == 10

    # Можно делать фильтрацию
    f = s[s > 20]
    assert f.shape == (1,)

    # Есть некоторые функции для вычисления статистики
    assert s.sum() == 60
    assert s.max() == 30
    assert s.min() == 10
    assert s.mean() == 20  # среднее
    assert s.median() == 20  # медиана
    assert s.std() == 10  # стандартное отклонение (показатель рассеивания от среднего)


def test_data_types_data_frame():
    """
    DataFrame
    Двумерная таблица (строки и колонки), похожа на Excel или SQL таблицу.
    Каждая колонка — это Series, а весь DataFrame — это набор Series с общим индексом строк.

    У DataFrame есть:
     - строки (index) — 0,1,2,… или пользовательские метки
     - колонки (columns) — имена столбцов
     - данные (values) — сами значения в виде 2D массива
    """

    # 1. Из словаря списков (классический способ)
    # Будут 2 колонки A и B с 3 строками
    df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
    assert df1.shape == (3, 2)

    # 2. Из списка словарей.
    # Будут также 2 колонки A и B с 3 строками.
    # Тут каждая строка передается отдельно.
    df2 = pd.DataFrame(
        [
            {"A": 1, "B": 4},
            {"A": 2, "B": 5},
            {"A": 3, "B": 6},
        ]
    )
    assert df2.shape == (3, 2)

    # 3. Из NumPy массива
    # @idiomatic: local import
    import numpy as np

    pd.DataFrame(np.random.randn(3, 2), columns=["x", "y"])

    # Создание DataFrame из словаря
    data = {
        "Имя": ["Аня", "Борис", "Вера"],
        "Возраст": [25, 30, 22],
        "Пол": ["Ж", "М", "Ж"],
    }
    df = pd.DataFrame(data)

    """
    Describe - генерирует базовую статистику для каждой колонки DataFrame.
    
    Для числовых:
    count	Количество непустых (non-NaN) значений
    mean	Среднее значение
    std	Стандартное отклонение (по выборке, ddof=1)
    min	Минимальное значение
    25%	Первый квартиль (Q1) — 25% значений меньше
    50%	Медиана (Q2) — 50% значений меньше
    75%	Третий квартиль (Q3) — 75% значений меньше
    max	Максимальное значение
    
    Для нечисловых
    unique — количество уникальных значений
    top — самое часто встречающееся значение
    freq — сколько раз встречается top
    """
    # @idiomatic using builtin func all()
    print(df.describe(include=all))

    # shape возвращает кортеж с двумя цифрами, (кол-во столбцов, кол-во строк):
    assert df.shape == (3, 3)

    # Многие методы не меняют df, а возвращают новый.

    # 0) Индекс
    # Можно установить индекс, тогда получится что колонка с именами является уникальной и данные относятся к имени
    idf = df.set_index("Имя")
    assert list(idf.loc["Аня"]) == [
        25,
        "Ж",
    ]  # тут индексы - уже имена, а имя туда уже не входит
    assert list(idf.iloc[0]) == [25, "Ж"]  # по номеру строки

    # 1) Доступ к колонкам
    # Можно получить всю колонку в виде Series
    assert list(df["Имя"]) == ["Аня", "Борис", "Вера"]

    # Можно и несколько, тогда результатом будет DataFrame, а аргументами будет list
    df2 = df[["Имя", "Возраст"]]
    assert df2.shape == (3, 2)

    # 2) Доступ к строкам
    # Доступ к строке по индексу (тут индексы - числа)
    assert list(df.loc[0]) == ["Аня", 25, "Ж"]
    # по номеру строки
    assert list(df.iloc[0]) == ["Аня", 25, "Ж"]

    # 3) Доступ к ячейкам
    assert df.loc[1, "Возраст"] == 30
    assert df.iloc[1, 1] == 30

    # 4) Фильтрация
    # Будут строки 2 строки с теми же 3 столбцами
    assert df[df["Возраст"] > 24].shape == (2, 3)
    # На самом деле мы фильтруем Series и далее из dataFrame берем нужные строки
    s = df["Возраст"] > 24
    assert isinstance(s, pd.Series)

    # 5) Изменение
    # Добавим колонку
    df["Город"] = ["Москва", "СПб", "Казань"]
    assert df.shape == (3, 4)
    # Поменяем возраст в первой строке
    df.loc[0, "Возраст"] = 26

    # 6) Сортировка
    df = df.sort_values(by="Возраст", ascending=False)

    # 7) Объединение и слияние DataFrame
    # 7.1) Вертикальное - добавятся новые строки
    # Если индексы не совпадают => появляются NaN - в df2 нет колонки "Пол", то она добавится как NaN, для значений df2
    df1 = pd.DataFrame(
        {"Имя": ["Аня", "Борис"], "Возраст": [25, 30], "Пол": ["Ж", "М"]}
    )
    df2 = pd.DataFrame({"Имя": ["Вера", "Гоша"], "Возраст": [22, 28]})

    con = pd.concat([df1, df2])
    assert con.shape == (4, 3)

    # 7.2) Горизонтальное - колонки буду расположены рядом двигаясь по ширине
    df1 = pd.DataFrame({"A": [1, 2, 3]})
    df2 = pd.DataFrame({"B": [4, 5, 6]})

    con = pd.concat([df1, df2], axis=1)
    assert con.shape == (3, 2)

    # как sql-join
    df1 = pd.DataFrame({"product_id": [1, 2, 3], "price": [400, 500, 600]})
    df2 = pd.DataFrame(
        {"product_id": [1, 2, 3], "name": ["bread", "water", "gasoline"]}
    )
    join = pd.merge(df1, df2)
    assert join.shape == (3, 3)

    # 8) Группировка
    # MEAN(Возраст) BY Город
    df = pd.DataFrame(
        {
            "Город": ["Москва", "СПб", "Москва", "Казань", "СПб", "Москва"],
            "Возраст": [25, 30, 22, 28, 35, 40],
            "Зарплата": [100, 120, 90, 110, 130, 150],
        }
    )
    # grouped — это объект, который умеет выполнять агрегирующие функции.
    grouped = df.groupby("Город")

    # Средний возраст по городам
    assert grouped["Возраст"].mean().shape == (3,)

    # Несколько агрегирующих функций
    assert grouped["Возраст"].agg(["mean", "max", "min"]).shape == (3, 3)

    # 9) Срезы
    # У DataFrame срез может быть копией, но иногда Pandas возвращает view (зависит от операции и версии).
    # Чтобы гарантированно работать с копией, используют .copy():
    # Срез по строкам (iloc)
    assert df.iloc[1:3].shape == (2, 3)
    assert df.loc[1:2].shape == (2, 3)  # здесь индекс это числа
    # Срез по колонкам
    assert df[["Возраст", "Город"]].shape == (6, 2)


def ptest_read_csv():
    df = pd.read_csv("data.csv")
    assert df.shape == (100, 10)
