import random
from collections import defaultdict

"""
Цепь Маркова — последовательность случайных событий, где вероятность наступления каждого события зависит только от 
состояния, достигнутого в ПРЕДЫДУЩЕМ событии.
В случае цепи Маркова N-го порядка вероятность наступления каждого события зависит от состояния, достигнутого в N-предыдущих событиях.
Пример: погода сегодня такая-то, завтра зависит от сегодня. Но не от вчера или неделю назад. Это марковское свойство.

Цепь Маркова — это про упрощение реальности: забываем прошлое, смотрим только на настоящее. Поэтому они не подходят там 
где важна память, тренды, контекст.

На цепях Маркова работают:
- ранние генераторы текстов
- AI NPC
- Алгоритм PageRang Google

Формально, это:
- набор состояний
- вероятности перехода между ними.

1) Матрица переходов
- строка - текущее состояние
- столбец следующее состояние

Пример для 3 состояний: Солнечно, Облачно, Дождь
P = [
    [0.6 0.3 0.1], 
    [0.2 0.5 0.3]
    [0.3 0.3 0.4]
]

| Сегодня \\ Завтра | (солнечно) | (облачно) | (дождь) |
|------------------|------------|-----------|---------|
| (солнечно)       | 0.6        | 0.3       | 0.1     |
| (облачно)        | 0.2        | 0.5       | 0.3     |
| (дождь)          | 0.3        | 0.3       | 0.4     |

Сумма каждой строки = 1, потому что это вероятность всех исходов.
Читают матрицу так:
1) Смотришь на сегодня, выбираешь сегодняшнее состояние из 3 строк.
2) Столбцы в этой строке указывают на вероятности 3 состояний завтра.

Например, если сегодня облачно, то 0.2 - что солнечно, 0.5 - облачно, 0.3 - дождь.

2) Прогнозирование
Умножая вектор - текущее состояние на матрицу перехода - мы получим новое состояние.

Например, сегодня V0 = (0, 1, 0) - (0 солнца, 100% облачно, 0 - дождь)
Vt+1 = Vt * P

Таким образом V1 = (0.2, 0.5, 0.3), значит завтра - (20% солнца, 50% облачно, 30% - дождь)

Итого: Формула всегда такая. В классической цепи Маркова матрица постоянная.

В более сложных случаях она корректируется и формула получается вида Vt+1 = Vt * P1 * P2, тогда уже не одна матрица, 
а цепочка разных. Матрицы меняют в ML, чтобы учесть сезонность, или какие то внешние факторы.
"""
names = [line.lower().strip() for line in open('input.txt') if line.strip()]
# random.shuffle(names)
print(f"num docs: {len(names)}")

"""
Порядок марковской модели - в нашем случае означает на сколько букв назад смотрит.
(можно было назвать window)
"""
order = 2

START = '^'
END = '$'

def learn() -> dict[str, list[str]]:
    # Обученная модель
    res = defaultdict(list)

    for name in names:
        # Дополненная символами START имя. Символы нужны для старта, чтобы глядя на order-букв назад получать START.
        padded_name = START * order + name + END

        for i in range(len(padded_name) - order):
            # Что имеем предыдущих order-шагах
            prev_chars = padded_name[i:i + order]

            # Что хотим
            next_char = padded_name[i + order]

            # Запоминаем
            res[prev_chars].append(next_char)
            # print(key, next_char)

    return res

model: dict[str, list[str]] = learn()

def gen(min_len=3, max_len=10):
    while True:
        result = ''

        # стартуем со спецсимволов
        current = START * order

        while True:
            # Какие символы могли идти после текущего
            next_chars = model.get(current)
            if not next_chars:
                break

            """
            Вместо использования матрицы перехода - тут просто random выбор.
            Если расписать как матрицу, то получилось бы так:
            v = (0, 0, .... 1, 0, ...0) - вектор текущего состояния, где 1 стоит на позиции current, 0 - для всех остальных сочетаний.
            P = [
                0, ..., 0, 1, 0, ...0,   
                0, ..., 0, 0, 0, ...0,   
                0, ..., 0, 0, 1, ...0,  
                .... 
            ]
            Размер P = строк равно количеству в V, столбцов - общее кол-во букв. И единицы в матрице стояли бы там, 
            где сочетание current может переходить в next_char. 
            Тогда Vt+1 = Vt * P, и мы бы получили новый вектор, который можно было бы интерпретировать как вероятности 
            для всех букв. 
            Но так как мы не храним вероятности, а просто список возможных букв, то выбираем случайно из этого списка.
            """
            next_char = random.choice(next_chars)
            if next_char == END:
                break

            result += next_char

            # Из текущего "окна" забываем первый символ с начала и добавляем новый в конец
            current = current[1:] + next_char

            if len(result) > max_len:
                break

        if min_len <= len(result) <= max_len:
            return result

# Результат
max_length = max(len(s) for s in names)
min_length = min(len(s) for s in names)
print(f'{min_length=}, {max_length=}')

for _ in range(10):
    new_name = gen(min_len=6, max_len=max_length)
    print(gen())