import threading
import time

"""
Для чего: 

Condition (условная переменная) — это механизм, который позволяет:
Потоку ждать наступления определённого состояния (wait)
Другому потоку оповестить ожидающие потоки (notify / notify_all)
Важно: поток, который вызывает wait() или notify(), должен держать внутренний lock.

Как реализован: RLock + []Lock waiters

1) RLock (_lock) — внутренний рекурсивный lock
2) Список _waiters — потоков, которые ждут сигнала
Каждый ждущий поток добавляет в этот список свой личный lock/event, на котором он заблокируется.

Метод condition.wait():
0) Пытаемся захватить RLock неблокирующим образом (через _is_owned - так как RLock - то повторно можно). Если не удалось
тогда exception, значит пытаемся делать wait не захватив RLock
1) Создаем Lock для потока, сразу захватываем его
2) Добавляем Lock этого потока в список waiters.
3) Отпускаем общий RLock, чтобы другие потоки могли работать.
4) Делаем еще раз waiter.acquire, это приводит к тому что наш Lock блокируется пока кто то другой не вызовет waiter.release.
5) Когда владеющий RLock вызывают condition.notify(), то делаем waiter.release() одного из waiters.
6) В итоге какой то их waiters готов к работе и пытается захватить RLock работать.
Захват RLock осуществляется в _is_owned
7) владеющий RLock выходит из with и RLock освобождается.

Метод condition.notify()

Waiters получит сигнал, но не начнёт выполняться, пока снова не получит основной RLock
(т.к. wait() после пробуждения делает acquire(self._lock)).

Метод  condition.notifyAll()
Все потоки пробуждаются, но реально работать начнёт тот, кто первым захватит основной lock.

Почему Condition требует, чтобы основной lock был уже захвачен?

Потому что:

wait() освобождает lock → затем ждёт
notify() предполагает, что вы что-то изменили в общем ресурсе → и хотите разбудить ожидающих

Если бы notify() можно было вызвать без lock, была бы гонка:
другой поток ещё не закончил обновлять состояние
а вы уже разбудили потоки, которые прочтут “грязные” данные
"""

if __name__ == '__main__':
    cond = threading.Condition()
    ready = False


    def consumer():
        global ready

        with cond:
            """
            Ждем в цикле, потому что
            1) Ложное/случайное пробуждение (spurious wakeups)
            Поток может проснуться из wait() без notify().
            Это не ошибка Python — такое реально происходит на уровне ОС.
            Если использовать if, поток подумает, что ресурс готов, и продолжит работу, хотя на самом деле он ещё не готов.
            2) Несколько потоков и notify_all()
            Если несколько потоков ждут Condition и один поток делает notify_all(), все пробуждаются.
            Только один поток реально может получить ресурс или увидеть правильное состояние.
            Остальные должны снова проверить условие.
            Без цикла они продолжат работать с неправильным состоянием.
            3) Гарантия атомарности
            wait() временно освобождает lock и блокируется.
            После пробуждения поток снова захватывает lock.
            Только под lock проверяем условие not ready.
            Цикл гарантирует, что поток не выйдет из wait() пока ресурс реально не готов.
            """
            while not ready:
                cond.wait()

        print("Consumed!")


    def producer():
        global ready
        time.sleep(1)

        with cond:
            ready = True
            cond.notify_all()


    threading.Thread(target=consumer).start()
    threading.Thread(target=producer).start()
