import cv2
import pytesseract
import imutils

"""
OpenCV — это библиотека компьютерного зрения и обработки изображений.

Что умеет OpenCV:
Обработка изображений (фильтры, изменение размера, повороты, обрезка, сглаживание)
Обнаружение объектов (лица, глаза, автомобили, люди, жесты)
Распознавание изображений (классификация с использованием моделей машинного обучения)
Работа с видео (захват с камеры, отслеживание движения, кадрирование)
Калибровка камер и 3D-реконструкция(работа с несколькими камерами, восстановление глубины)
Создание эффектов в реальном времени (фильтры как в Instagram, AR-эффекты)

Библиотека может визуализировать результат в отдельных окнах и работать с клавиатурой (используя HighGUI => GUI системы).
"""

image = cv2.imread('car.jpg')
if image is None:
    print('Failed to open image')
    exit()

image = imutils.resize(image, width=600)

gray = cv2.cvtColor(image, cv2.COLOR_BGR2GRAY)

cv2.imshow("Original", image)
cv2.imshow("Gray", gray)

cv2.waitKey(0)
cv2.destroyAllWindows()