from .condition import Condition


class Event:
    """
    Аналог threading.Event, реализованный на собственном Condition.
    Event - это простой синхронизатор, который позволяет одному потоку сигнализировать другим о наступлении определенного события.

    Для чего:
    - «Когда будешь готов — дай знать»
    - «Подождите старта»
    - «Остановиться / завершиться»
    - «Один раз включить что-то»

    Отличия от Condition:
    Простой способ сообщать об изменении флага. Клиенту не нужно проверять доступность флага в цикле, так как уведомляются сразу все.
    Condition не содержит внутренний флаг. Поток сам должен проверять условие с какой-то переменной в цикле.

    Как работает:
    Внутри Condition, который уведомляет ждущих (всех сразу). Изменение флага защищено мьютексом этого Condition.

    1) Метод set(): Устанавливает флаг = True. Все ожидающие потоки просыпаются.
    2) Метод wait(timeout): Блокирует поток, пока флаг не станет True или не истечёт timeout.
    3) Метод clear(): Устанавливает флаг = False.
    3) Метод is_set(): Проверяет состояние флага.
    """

    __slots__ = ('__flag', '__cond')

    def __init__(self):
        self.__flag = False
        self.__cond = Condition()

    def set(self):
        """
        Устанавливает флаг и пробуждает все ожидающие потоки.
        """
        with self.__cond:
            self.__flag = True
            self.__cond.notify_all()

    def wait(self, timeout=None) -> bool:
        """
        Блокирует поток пока флаг не будет True.
        Возвращает всегда True.
        """
        if self.__flag:
            return True

        with self.__cond:
            self.__cond.wait(timeout)
            return True

    def clear(self):
        """
         Потоки которые заново вызывают wait будут заблокированы до set.
         """
        with self.__cond:
            self.__flag = False

    def is_set(self):
        return self.__flag
